{"products":[{"id":"0","year":"2014","author":"Майкл Миковски, Джош Пауэлл","name":"Single Page Web Applications","image_url":"https://books.google.com.ua/books/content?id=XVUHCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70Uf4iyWU3S97Zrtl9ve8uC0JchFaKVqAe82PPjpo_WshNfaCTDLb-M7tLecpWjfzgRtMdHaFpWiHsGzo_VOXN7ks2HyFDq5RwQ4neaOfONVZ-bkF0DTlDNEKSb9Zad7f6c5KEv","except":"Если ваш сайт представляет собой набор дергающихся страниц, связанных ссылками, то вы отстали от жизни. Следующей ступенью вашей карьеры должны стать одностраничные приложения (SPA). В таком приложении отрисовка пользовательского интерфейса и бизнес-логика перенесены в браузер, а взаимодействие с сервером сводится к синхронизации данных. Пользователь работает с таким сайтом, как с персональным приложением на рабочем столе, что гораздо удобнее и приятнее. Однако разрабатывать, сопровождать и ","content":"Если ваш сайт представляет собой набор дергающихся страниц, связанных ссылками, то вы отстали от жизни. Следующей ступенью вашей карьеры должны стать одностраничные приложения (SPA). В таком приложении отрисовка пользовательского интерфейса и бизнес-логика перенесены в браузер, а взаимодействие с сервером сводится к синхронизации данных. Пользователь работает с таким сайтом, как с персональным приложением на рабочем столе, что гораздо удобнее и приятнее. Однако разрабатывать, сопровождать и тестировать SPA нелегко. В этой книге показано как организуется командная разработка передовых SPA – проектирование, тестирование, сопровождение и развитие – с применением JavaScript на всех уровнях и без привязки к какому-то конкретному каркасу.Попутно вы отточите навыки работы с HTML5, CSS3 и JavaScript и узнаете об использовании JavaScript не только в браузере, но также на сервере и в базе данных."},{"id":"1","year":"2016","author":"John Resig, Bear Bibeault, Josip Maras","name":"Secrets of the JavaScript Ninja","image_url":"https://books.google.com.ua/books/content?id=vxbUjwEACAAJ&printsec=frontcover&img=1&zoom=1&imgtk=AFLRE73UNK9XOCMajJFqD6y9b-vOVyMxRUWsOw26Bcp-6u67athIrNA3GxxD2TAOVKjnNQ8GF2FFmaYs0CfKOakpIoazqdut52VHfvGJIb_u1i3n6czfN2cu7eAdLOiHfeZcZuzeij20","except":"More than ever, the web is a universal platform for all types of applications, and JavaScript is the language of the web. If you're serious about web development, it's not enough to be a decent JavaScript coder. You need to be ninja-stealthy, efficient, and ready for anything. This book ","content":""}]}